#### AddField Method (ScheduleFieldType)

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Adds a regular field at the end of the list.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ScheduleField AddField( 	ScheduleFieldType fieldType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddField ( _ 	fieldType As ScheduleFieldType _ ) As ScheduleField ``` |

| Visual C++ |
| --- |
| ``` public: ScheduleField^ AddField( 	ScheduleFieldType fieldType ) ``` |

#### Parameters

fieldType
:   Type:  Autodesk.Revit.DB ScheduleFieldType
     The type of data displayed by the field.

#### Return Value

The new field.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The field specified by fieldType may not included in this ScheduleDefinition. -or- The field specified by fieldType is already included in this ScheduleDefinition. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ScheduleDefinition Class

AddField Overload

Autodesk.Revit.DB Namespace